# BRepBuilderEdgeGeometry Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BRepBuilderEdgeGeometry Class
Members See Also
---
An abstract class used by BRepBuilder to represent the geometry of an edge. Specific edge-geometry representations are represented by subclasses.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class BRepBuilderEdgeGeometry : IDisposable
```

Visual Basic
---
```text
Public Class BRepBuilderEdgeGeometry _
	Implements IDisposable
```

Visual C++
---
```text
public ref class BRepBuilderEdgeGeometry : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BRepBuilderEdgeGeometry
# See Also
BRepBuilderEdgeGeometry Members
Autodesk.Revit.DB Namespace